       IDENTIFICATION DIVISION.
       PROGRAM-ID. BILLING.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-AMOUNT PIC 9(5)V99 VALUE 12345.67.
       01 WS-TAX    PIC 9(5)V99 VALUE 0.19.
       01 WS-TOTAL  PIC 9(5)V99.
       PROCEDURE DIVISION.
           COMPUTE WS-TOTAL = WS-AMOUNT * (1 + WS-TAX).
           DISPLAY "Legacy Billing Processed: " WS-TOTAL.
           STOP RUN.
